daoweifan/trampoline/examples/cortex/armv7em/stm32f303/Nucleo-F302R8/blink/blink.c
#include "tpl_os.h"
#include "stm32f30x.h"
#include "stm32f30x_rcc.h"
#include "stm32f30x_gpio.h"

#define APP_Task_blink_START_SEC_CODE
#include "tpl_memmap.h"

//init PB.13 as output (LED 1 on pin 13).
void initUserLed()
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  /* Enable the GPIO_LED Clock */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);

  /* Configure the GPIO_LED pin */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
}

FUNC(int, OS_APPL_CODE) main(void)
{
  initUserLed(); 
  StartOS(OSDEFAULTAPPMODE);
  return 0;
}

VAR(int, AUTOMATIC) blink_var;

TASK(blink)
{
  if (blink_var)
    GPIOB->ODR ^= GPIO_Pin_13;	//toggle user led.
  else
    GPIOB->ODR = 0;
  TerminateTask();
}

TASK(blink_gate)
{
  blink_var = !blink_var;  //toggle blink control var, long period
  TerminateTask();
}

#define APP_Task_blink_STOP_SEC_CODE
#include "tpl_memmap.h"

#define OS_START_SEC_CODE
#include "tpl_memmap.h"
/*
 *  * This is necessary for ST libraries
 *   */
FUNC(void, OS_CODE) assert_failed(uint8_t* file, uint32_t line)
{
}
#define OS_STOP_SEC_CODE
#include "tpl_memmap.h"

